package source;

public class Main {

    public static void main(String[] args) {
//        Test08.除以0的例外();
//        Test08.超出陣列索引的例外();
//        Test08.超出字串索引的例外();
//        Test08.空指標的例外();
//        Test08.格式錯的例外();
//        Test08.多型的例外();
//        /////////////////////////////////////
//        Test08.呼叫除以0的例外_自行處理();
//        Test08.呼叫除以0的例外_丟出去1();
//        Test08.呼叫除以0的例外_丟出去2();
//
//        /////////////////////////////////
//        Test08.checked的例外1();
//        //Test08.checked的例外2();//不能呼叫
//        Test08.unchecked的例外();
//        ///////////////////////////////////
//        Test08.系統引發1();
//        Test08.使用者引發1();
//        Test08.系統引發2();
//        Test08.使用者引發2();
//        Test08.使用者引發3();
//        Test08.使用者引發4();
//        Test08.使用者引發5();
//        ///////////////////////////////////
//        Test08.自行處理的例外1();
//        Test08.自行處理的例外2_多重捕捉();
//        Test08.自行處理的例外3();
//        ///////////////////////////////////
//        Test08.系統API丟出的例外();
//
//        Test08.同一段兩個例外_unchecked1();
//        Test08.同一段兩個例外_checked1();
//
//        Test08.不同段兩個例外_unchecked1();
//        Test08.不同段兩個例外_unchecked2();
//
//        Test08.不同段兩個例外_checked1();
//        Test08.不同段兩個例外_checked2();
//
//        Test08.呼叫自訂的例外類別_自行處理();
//        Test08.呼叫自訂的例外類別_丟出去();
//        Test08.呼叫sumxy();
//        Test08.含蓋例外1();
//        Test08.處理例外訊息的方法();
    }
}
