package source;

public class Main {

    public static void main(String[] args) {
//        Test13.主執行緒();
//        Test13.產生執行緒_繼承();
//        Test13.產生執行緒_實作();
//        Test13.產生執行緒_區域巢狀類別_繼承();
//        Test13.產生執行緒_區域巢狀類別_實作();
//        Test13.產生執行緒_匿名類別_繼承();
//        Test13.產生執行緒_匿名類別_實作1();
//        Test13.產生執行緒_匿名類別_實作2();
//        Test13.產生執行緒_匿名類別_實作3();
//        Test13.join練習();
//        Test13.yield練習();
//        Test13.共用程式不共用資料();
//        Test13.共用程式共用資料();
//        Test13.共用程式共用資料_同步化區塊();
//        Test13.共用程式共用資料_同步化方法();
//        Test13.共用程式不共用資料_同步化方法();
//        Test13.生產者與消費者();
//        Test13.階乘();      
        Test13.費式數列();
    }
}
